[Killed] BlockStatement
controllers/Post.js:5:36
 const {firebase,admin}= require('../config')
 const firestore = getFirestore(firebase);
 
-const updatePost = async(req,res)=>{
-  const myCollection = collection(firestore, 'Posts');
-  const docRef = doc(myCollection, req.params.postId);
-  try {
-      await updateDoc(docRef, req.body);
-      res.send({ message: 'Document successfully updated!' });
-    } catch (error) {
-      console.error('Error updating document: ', error);
-    }
-}
+const updatePost = async(req,res)=>{}
 
 const addComment = async(req,res)=>{
killedBy: updatePost should update data successfully and return response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, "Posts"

Number of calls: 0

[Killed] BlockStatement
controllers/Post.js:8:7
 const updatePost = async(req,res)=>{
   const myCollection = collection(firestore, 'Posts');
   const docRef = doc(myCollection, req.params.postId);
-  try {
-      await updateDoc(docRef, req.body);
-      res.send({ message: 'Document successfully updated!' });
-    } catch (error) {
+  try {} catch (error) {
       console.error('Error updating document: ', error);
     }
killedBy: updatePost should update data successfully and return response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"doc": [Function mockConstructor]}, {"test": "data"}

Number of calls: 0

[Killed] StringLiteral
controllers/Post.js:10:27
   const docRef = doc(myCollection, req.params.postId);
   try {
       await updateDoc(docRef, req.body);
-      res.send({ message: 'Document successfully updated!' });
+      res.send({ message: "" });
     } catch (error) {
       console.error('Error updating document: ', error);
killedBy: updatePost should update data successfully and return response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Document successfully updated!",
+   "message": "",

[Killed] ObjectLiteral
controllers/Post.js:10:16
   const docRef = doc(myCollection, req.params.postId);
   try {
       await updateDoc(docRef, req.body);
-      res.send({ message: 'Document successfully updated!' });
+      res.send({});
     } catch (error) {
       console.error('Error updating document: ', error);
killedBy: updatePost should update data successfully and return response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Document successfully updated!",
- }

[Killed] BlockStatement
controllers/Post.js:16:36
     }
 }
 
-const addComment = async(req,res)=>{
-  const myCollection = collection(firestore, 'Comments');
-  try{
-    const data = req.body;
-    await addDoc(myCollection, data)
-    .then((docRef) => {
-      const d = doc(myCollection, docRef.id);
-      updateDoc(d, {commentId:docRef.id});
-      res.send({ message: 'Data saved successfully' });
-    })
-    .catch((error) => {
-      console.error('Error adding document: ', error);
-    });
-  }
-  catch(error){
-    console.error("Error addcomment: ", error);
-  }
-}
+const addComment = async(req,res)=>{}
 const getOneComment = async (req,res)=>{
   const myCollection = collection(firestore, 'Comments');
killedBy: addComment should save data successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, "Comments"

Number of calls: 0

[Killed] StringLiteral
controllers/Post.js:17:46
 }
 
 const addComment = async(req,res)=>{
-  const myCollection = collection(firestore, 'Comments');
+  const myCollection = collection(firestore, "");
   try{
     const data = req.body;
killedBy: addComment should save data successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, "Comments"
Received: undefined, ""

Number of calls: 1

[Killed] BlockStatement
controllers/Post.js:18:6
 
 const addComment = async(req,res)=>{
   const myCollection = collection(firestore, 'Comments');
-  try{
-    const data = req.body;
-    await addDoc(myCollection, data)
-    .then((docRef) => {
-      const d = doc(myCollection, docRef.id);
-      updateDoc(d, {commentId:docRef.id});
-      res.send({ message: 'Data saved successfully' });
-    })
-    .catch((error) => {
-      console.error('Error adding document: ', error);
-    });
-  }
+  try{}
   catch(error){
     console.error("Error addcomment: ", error);
killedBy: addComment should save data successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"message": "Data saved successfully"}

Number of calls: 0

[Killed] BlockStatement
controllers/Post.js:21:23
   try{
     const data = req.body;
     await addDoc(myCollection, data)
-    .then((docRef) => {
-      const d = doc(myCollection, docRef.id);
-      updateDoc(d, {commentId:docRef.id});
-      res.send({ message: 'Data saved successfully' });
-    })
+    .then((docRef) => {})
     .catch((error) => {
       console.error('Error adding document: ', error);
killedBy: addComment should save data successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"message": "Data saved successfully"}

Number of calls: 0

[Killed] StringLiteral
controllers/Post.js:24:27
     .then((docRef) => {
       const d = doc(myCollection, docRef.id);
       updateDoc(d, {commentId:docRef.id});
-      res.send({ message: 'Data saved successfully' });
+      res.send({ message: "" });
     })
     .catch((error) => {
killedBy: addComment should save data successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Data saved successfully",
+   "message": "",

[Killed] BlockStatement
controllers/Post.js:26:23
       updateDoc(d, {commentId:docRef.id});
       res.send({ message: 'Data saved successfully' });
     })
-    .catch((error) => {
-      console.error('Error adding document: ', error);
-    });
+    .catch((error) => {});
   }
   catch(error){
killedBy: addComment should handle errors and console error response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error adding document: ", Any<Error>

Number of calls: 0

[NoCoverage] BlockStatement
controllers/Post.js:30:15
       console.error('Error adding document: ', error);
     });
   }
-  catch(error){
-    console.error("Error addcomment: ", error);
-  }
+  catch(error){}
 }
 const getOneComment = async (req,res)=>{

[Timeout] BlockStatement
controllers/Post.js:34:40
     console.error("Error addcomment: ", error);
   }
 }
-const getOneComment = async (req,res)=>{
-  const myCollection = collection(firestore, 'Comments');
-  const docRef = doc(myCollection, req.params.commentId);
-  try{
-  const documentSnapshot = await getDoc(docRef);
-
-if (documentSnapshot.exists()) {
-  const data = documentSnapshot.data();
-  res.json({success:true, comment:data});
-} else {
-  res.json({success:true, comment:'-1'});
-}
-  }
-  catch(e){
-      res.json({
-          success:false,
-          message:'something went wrong when get data from comment'
-      })
-  }
-}
+const getOneComment = async (req,res)=>{}
 module.exports={ updatePost, addComment, getOneComment,}

[Survived] StringLiteral
controllers/Post.js:35:46
   }
 }
 const getOneComment = async (req,res)=>{
-  const myCollection = collection(firestore, 'Comments');
+  const myCollection = collection(firestore, "");
   const docRef = doc(myCollection, req.params.commentId);
   try{

[Timeout] BlockStatement
controllers/Post.js:37:6
 const getOneComment = async (req,res)=>{
   const myCollection = collection(firestore, 'Comments');
   const docRef = doc(myCollection, req.params.commentId);
-  try{
-  const documentSnapshot = await getDoc(docRef);
-
-if (documentSnapshot.exists()) {
-  const data = documentSnapshot.data();
-  res.json({success:true, comment:data});
-} else {
-  res.json({success:true, comment:'-1'});
-}
-  }
+  try{}
   catch(e){
       res.json({

[Killed] BooleanLiteral
controllers/Post.js:42:21
 
 if (documentSnapshot.exists()) {
   const data = documentSnapshot.data();
-  res.json({success:true, comment:data});
+  res.json({success:false, comment:data});
 } else {
   res.json({success:true, comment:'-1'});
killedBy: getOneComment should return comment data when document exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ObjectLiteral
controllers/Post.js:42:12
 
 if (documentSnapshot.exists()) {
   const data = documentSnapshot.data();
-  res.json({success:true, comment:data});
+  res.json({});
 } else {
   res.json({success:true, comment:'-1'});
killedBy: getOneComment should return comment data when document exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: undefined

[Killed] BlockStatement
controllers/Post.js:43:8
 if (documentSnapshot.exists()) {
   const data = documentSnapshot.data();
   res.json({success:true, comment:data});
-} else {
-  res.json({success:true, comment:'-1'});
-}
+} else {}
   }
   catch(e){
killedBy: getOneComment should return -1 when document does not exist
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BooleanLiteral
controllers/Post.js:44:21
   const data = documentSnapshot.data();
   res.json({success:true, comment:data});
 } else {
-  res.json({success:true, comment:'-1'});
+  res.json({success:false, comment:'-1'});
 }
   }
killedBy: getOneComment should return -1 when document does not exist
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] StringLiteral
controllers/Post.js:44:35
   const data = documentSnapshot.data();
   res.json({success:true, comment:data});
 } else {
-  res.json({success:true, comment:'-1'});
+  res.json({success:true, comment:""});
 }
   }
killedBy: getOneComment should return -1 when document does not exist
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "-1"
Received: ""

[Timeout] BlockStatement
controllers/Post.js:47:11
   res.json({success:true, comment:'-1'});
 }
   }
-  catch(e){
-      res.json({
-          success:false,
-          message:'something went wrong when get data from comment'
-      })
-  }
+  catch(e){}
 }
 module.exports={ updatePost, addComment, getOneComment,}
