[Killed] BlockStatement
controllers/Question.js:5:46
 const {firebase}= require('../config')
 const firestore = getFirestore(firebase);
 
-const getMaxquestion = async (userId, Part)=>{
-    const myCollection = collection(firestore, 'Users');
-    const docRef = doc(myCollection, userId);
-    try{
-    const documentSnapshot = await getDoc(docRef);
-  
-  if (documentSnapshot.exists()) {
-    if(Part == 'ListenPart1'||Part=='L1'){
-    const data = documentSnapshot.data().MaxQuestion?.L1 || 0;
-    return data;
-    }
-  } else {
-   return 0;
-  }
-    }
-    catch(e){
-      console.error('Error get document: ', e);
-      return 0;
-    }
-}
+const getMaxquestion = async (userId, Part)=>{}
 const getQuestion = async (req,res)=>{
     const myCollection = collection(firestore, req.params.Part);
killedBy: getMaxquestion returns the max question for Listen Part 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] BlockStatement
controllers/Question.js:11:34
     try{
     const documentSnapshot = await getDoc(docRef);
   
-  if (documentSnapshot.exists()) {
-    if(Part == 'ListenPart1'||Part=='L1'){
-    const data = documentSnapshot.data().MaxQuestion?.L1 || 0;
-    return data;
-    }
-  } else {
+  if (documentSnapshot.exists()) {} else {
    return 0;
   }
killedBy: getMaxquestion returns the max question for Listen Part 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] BlockStatement
controllers/Question.js:20:13
    return 0;
   }
     }
-    catch(e){
-      console.error('Error get document: ', e);
-      return 0;
-    }
+    catch(e){}
 }
 const getQuestion = async (req,res)=>{
killedBy: getMaxquestion returns 0 if an error occurs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Timeout] BlockStatement
controllers/Question.js:27:9
 }
 const getQuestion = async (req,res)=>{
     const myCollection = collection(firestore, req.params.Part);
-    try {
-      let max = 0;
-      await getMaxquestion(req.params.userId, req.params.Part).then((item) => {
-        max = item;
-      })
-      const num = parseInt(req.params.number)+parseInt(max)
-      const queryConstraints = [where("Order", ">", max),where("Order", "<=", num)];
-      const q = query(
-        myCollection,
-        ...queryConstraints
-      );
-      const querySnapshot = await getDocs(q);
-      const list = querySnapshot.docs.map((doc) => {
-        const data = doc.data();
-        const docId = doc.id;
-        return { ...data, Id: docId };
-      });
-      res.json({ success: true, Questions: list });
-    } catch (e) {
+    try {} catch (e) {
       res.json({
         success: false,

[Survived] ArrayDeclaration
controllers/Question.js:33:32
         max = item;
       })
       const num = parseInt(req.params.number)+parseInt(max)
-      const queryConstraints = [where("Order", ">", max),where("Order", "<=", num)];
+      const queryConstraints = [];
       const q = query(
         myCollection,

[Killed] BlockStatement
controllers/Question.js:39:52
         ...queryConstraints
       );
       const querySnapshot = await getDocs(q);
-      const list = querySnapshot.docs.map((doc) => {
-        const data = doc.data();
-        const docId = doc.id;
-        return { ...data, Id: docId };
-      });
+      const list = querySnapshot.docs.map((doc) => {});
       res.json({ success: true, Questions: list });
     } catch (e) {
killedBy: getQuestion should return success response with questions
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  2

  Object {
    "Questions": Array [
-     Object {

[Killed] ObjectLiteral
controllers/Question.js:42:16
       const list = querySnapshot.docs.map((doc) => {
         const data = doc.data();
         const docId = doc.id;
-        return { ...data, Id: docId };
+        return {};
       });
       res.json({ success: true, Questions: list });
killedBy: getQuestion should return success response with questions
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  2

  Object {
    "Questions": Array [
-     Object {

[Killed] ObjectLiteral
controllers/Question.js:44:16
         const docId = doc.id;
         return { ...data, Id: docId };
       });
-      res.json({ success: true, Questions: list });
+      res.json({});
     } catch (e) {
       res.json({
killedBy: getQuestion should return success response with questions
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 15
+ Received  +  1

- Object {
-   "Questions": Array [
-     Object {

[Timeout] BlockStatement
controllers/Question.js:45:17
         return { ...data, Id: docId };
       });
       res.json({ success: true, Questions: list });
-    } catch (e) {
-      res.json({
-        success: false,
-        message: "something went wrong when get data from getQuestion",
-      });
-    }
+    } catch (e) {}
  }
  const pushHistoryUser1 = async (userId, id, part, quantity, sign) => {

[Killed] EqualityOperator
controllers/Question.js:62:12
        const data = userData.HistoryPractice || [];
        data.unshift(id);
        await updateDoc(docRef, { HistoryPractice: data });
-       if (sign != "noMax") {
+       if (sign == "noMax") {
          let max = 0;
          await getMaxquestion(userId, part).then((item) => {
killedBy: pushHistoryUser1 should update HistoryPractice and MaxQuestion when document exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] ConditionalExpression
controllers/Question.js:62:12
        const data = userData.HistoryPractice || [];
        data.unshift(id);
        await updateDoc(docRef, { HistoryPractice: data });
-       if (sign != "noMax") {
+       if (false) {
          let max = 0;
          await getMaxquestion(userId, part).then((item) => {
killedBy: pushHistoryUser1 should update HistoryPractice and MaxQuestion when document exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Survived] ObjectLiteral
controllers/Question.js:71:36
          if (part == "L1") {
            const data2 = documentSnapshot.data().MaxQuestion || { L1: num };
            data2.L1 = num;
-           await updateDoc(docRef, { MaxQuestion: data2 });
+           await updateDoc(docRef, {});
          }
        }

[Killed] BlockStatement
controllers/Question.js:81:20
        };
        await setDoc(docRef, data);
      }
-   } catch (error) {
-    console.error('Error pushHistoryUser1: ', error);
-   }
+   } catch (error) {}
  };
  const pushPracticeHistory = async(req,res)=>{
killedBy: pushHistoryUser1 should return an error message on failure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error pushHistoryUser1: ", Any<Error>

Number of calls: 0

[Killed] StringLiteral
controllers/Question.js:82:19
        await setDoc(docRef, data);
      }
    } catch (error) {
-    console.error('Error pushHistoryUser1: ', error);
+    console.error("", error);
    }
  };
killedBy: pushHistoryUser1 should return an error message on failure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error pushHistoryUser1: ", Any<Error>
Received: "", [Error: Firestore error]

Number of calls: 1

[Killed] BlockStatement
controllers/Question.js:85:46
     console.error('Error pushHistoryUser1: ', error);
    }
  };
- const pushPracticeHistory = async(req,res)=>{
-    const myCollection = collection(firestore, 'PracticeHistory');
-    const data = req.body;
-    await addDoc(myCollection, data)
-    .then((docRef) => {
-      res.send({ message: 'Data saved successfully' });
-      pushHistoryUser1(req.params.userId,docRef.id, req.body.Part, req.body.Quantity,req.params.sign)
-    })
-    .catch((error) => {
-      console.error('Error adding document pushHistory: ', error);
-    });
- }
+ const pushPracticeHistory = async(req,res)=>{}
  const getOneQuestion = async(req,res)=>{
   const myCollection = collection(firestore, req.params.Part);
killedBy: pushPracticeHistory should save data successfully and call pushHistoryUser1
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, "PracticeHistory"

Number of calls: 0

[Killed] StringLiteral
controllers/Question.js:86:48
    }
  };
  const pushPracticeHistory = async(req,res)=>{
-    const myCollection = collection(firestore, 'PracticeHistory');
+    const myCollection = collection(firestore, "");
     const data = req.body;
     await addDoc(myCollection, data)
killedBy: pushPracticeHistory should save data successfully and call pushHistoryUser1
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, "PracticeHistory"
Received
       1: undefined, ""
       2: undefined, "Users"

Number of calls: 2

[Killed] BlockStatement
controllers/Question.js:97:41
       console.error('Error adding document pushHistory: ', error);
     });
  }
- const getOneQuestion = async(req,res)=>{
-  const myCollection = collection(firestore, req.params.Part);
-    const docRef = doc(myCollection, req.params.Qid);
-    try{
-    const documentSnapshot = await getDoc(docRef);
-  
-  if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(),Id: documentSnapshot.id}
-    res.json({success:true, question:data});
-  } else {
-    res.json({success:true, question:{}});
-  }
-    }
-    catch(e){
-      console.error('Error get document: ', e);
-    }
- }
+ const getOneQuestion = async(req,res)=>{}
 const get1PHistory = async(list)=>{
   const myCollection = collection(firestore, 'PracticeHistory');
killedBy: getoneQuestion should return a questions if successful
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"question": {"image": "abc.jpg", "level": "1", "order": "1"}, "success": true}

Number of calls: 0

[Killed] BlockStatement
controllers/Question.js:100:8
  const getOneQuestion = async(req,res)=>{
   const myCollection = collection(firestore, req.params.Part);
     const docRef = doc(myCollection, req.params.Qid);
-    try{
-    const documentSnapshot = await getDoc(docRef);
-  
-  if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(),Id: documentSnapshot.id}
-    res.json({success:true, question:data});
-  } else {
-    res.json({success:true, question:{}});
-  }
-    }
+    try{}
     catch(e){
       console.error('Error get document: ', e);
killedBy: getoneQuestion should return a questions if successful
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"question": {"image": "abc.jpg", "level": "1", "order": "1"}, "success": true}

Number of calls: 0

[Killed] BlockStatement
controllers/Question.js:103:34
     try{
     const documentSnapshot = await getDoc(docRef);
   
-  if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(),Id: documentSnapshot.id}
-    res.json({success:true, question:data});
-  } else {
+  if (documentSnapshot.exists()) {} else {
     res.json({success:true, question:{}});
   }
killedBy: getoneQuestion should return a questions if successful
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"question": {"image": "abc.jpg", "level": "1", "order": "1"}, "success": true}

Number of calls: 0

[Killed] ObjectLiteral
controllers/Question.js:104:18
     const documentSnapshot = await getDoc(docRef);
   
   if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(),Id: documentSnapshot.id}
+    const data = {}
     res.json({success:true, question:data});
   } else {
killedBy: getoneQuestion should return a questions if successful
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "question": Object {
-     "image": "abc.jpg",

[Killed] BooleanLiteral
controllers/Question.js:105:23
   
   if (documentSnapshot.exists()) {
     const data = {...documentSnapshot.data(),Id: documentSnapshot.id}
-    res.json({success:true, question:data});
+    res.json({success:false, question:data});
   } else {
     res.json({success:true, question:{}});
killedBy: getoneQuestion should return a questions if successful
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "question": Object {
+     "Id": undefined,

[Killed] BlockStatement
controllers/Question.js:106:10
   if (documentSnapshot.exists()) {
     const data = {...documentSnapshot.data(),Id: documentSnapshot.id}
     res.json({success:true, question:data});
-  } else {
-    res.json({success:true, question:{}});
-  }
+  } else {}
     }
     catch(e){
killedBy: getoneQuestion should return {} when document does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"question": {}, "success": true}

Number of calls: 0

[Killed] BooleanLiteral
controllers/Question.js:107:23
     const data = {...documentSnapshot.data(),Id: documentSnapshot.id}
     res.json({success:true, question:data});
   } else {
-    res.json({success:true, question:{}});
+    res.json({success:false, question:{}});
   }
     }
killedBy: getoneQuestion should return {} when document does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "question": Object {},
-   "success": true,

[Killed] ObjectLiteral
controllers/Question.js:107:14
     const data = {...documentSnapshot.data(),Id: documentSnapshot.id}
     res.json({success:true, question:data});
   } else {
-    res.json({success:true, question:{}});
+    res.json({});
   }
     }
killedBy: getoneQuestion should return {} when document does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "question": Object {},
-   "success": true,

[Killed] BlockStatement
controllers/Question.js:110:13
     res.json({success:true, question:{}});
   }
     }
-    catch(e){
-      console.error('Error get document: ', e);
-    }
+    catch(e){}
  }
 const get1PHistory = async(list)=>{
killedBy: getoneQuestion should return an error message on failure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error get document: ", Any<Error>

Number of calls: 0

[Killed] BlockStatement
controllers/Question.js:114:35
       console.error('Error get document: ', e);
     }
  }
-const get1PHistory = async(list)=>{
-  const myCollection = collection(firestore, 'PracticeHistory');
-  const dataList=[];
-  for(let i = 0; i < list.length; i++){
-    const docRef = doc(myCollection, list[i]);
-    try{
-    const documentSnapshot = await getDoc(docRef);
-  
-  if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(), Id: documentSnapshot.id};
-    dataList.push(data)
-  } 
-    }
-    catch(e){
-      console.error('Error get document: ', e);
-    }
-  }
-  return dataList;
- }
+const get1PHistory = async(list)=>{}
  module.exports={getQuestion, pushPracticeHistory, getOneQuestion, get1PHistory,getMaxquestion,pushHistoryUser1}
killedBy: get1PHistory should return an empty array if input list is empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Survived] StringLiteral
controllers/Question.js:115:46
     }
  }
 const get1PHistory = async(list)=>{
-  const myCollection = collection(firestore, 'PracticeHistory');
+  const myCollection = collection(firestore, "");
   const dataList=[];
   for(let i = 0; i < list.length; i++){

[Timeout] ArrayDeclaration
controllers/Question.js:116:18
  }
 const get1PHistory = async(list)=>{
   const myCollection = collection(firestore, 'PracticeHistory');
-  const dataList=[];
+  const dataList=["Stryker was here"];
   for(let i = 0; i < list.length; i++){
     const docRef = doc(myCollection, list[i]);

[Killed] ConditionalExpression
controllers/Question.js:117:18
 const get1PHistory = async(list)=>{
   const myCollection = collection(firestore, 'PracticeHistory');
   const dataList=[];
-  for(let i = 0; i < list.length; i++){
+  for(let i = 0; false; i++){
     const docRef = doc(myCollection, list[i]);
     try{
killedBy: get1PHistory should return a practice history data list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] EqualityOperator
controllers/Question.js:117:18
 const get1PHistory = async(list)=>{
   const myCollection = collection(firestore, 'PracticeHistory');
   const dataList=[];
-  for(let i = 0; i < list.length; i++){
+  for(let i = 0; i <= list.length; i++){
     const docRef = doc(myCollection, list[i]);
     try{
killedBy: get1PHistory should return an empty array if input list is empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 8

- Array []
+ Array [
+   Object {

[Timeout] BlockStatement
controllers/Question.js:119:8
   const dataList=[];
   for(let i = 0; i < list.length; i++){
     const docRef = doc(myCollection, list[i]);
-    try{
-    const documentSnapshot = await getDoc(docRef);
-  
-  if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(), Id: documentSnapshot.id};
-    dataList.push(data)
-  } 
-    }
+    try{}
     catch(e){
       console.error('Error get document: ', e);

[Killed] BlockStatement
controllers/Question.js:122:34
     try{
     const documentSnapshot = await getDoc(docRef);
   
-  if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(), Id: documentSnapshot.id};
-    dataList.push(data)
-  } 
+  if (documentSnapshot.exists()) {} 
     }
     catch(e){
killedBy: get1PHistory should return a practice history data list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ObjectLiteral
controllers/Question.js:123:18
     const documentSnapshot = await getDoc(docRef);
   
   if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(), Id: documentSnapshot.id};
+    const data = {};
     dataList.push(data)
   } 
killedBy: get1PHistory should return a practice history data list
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "Id"
Received path: []

Received value: {}

[Killed] StringLiteral
controllers/Question.js:128:21
   } 
     }
     catch(e){
-      console.error('Error get document: ', e);
+      console.error("", e);
     }
   }
killedBy: get1PHistory should handle error when getting document
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error get document: ", Any<Error>
Received: "", [Error: Firestore error]

Number of calls: 1
