[Killed] BlockStatement
controllers/User.js:5:35
 const {firebase,admin} = require('../config')
 const firestore = getFirestore(firebase);
 
-const createNotiBody = async(id)=>{
-  const myCollection = collection(firestore, 'Vocabulary');
-  const docRef = doc(myCollection, id);
-  const documentSnapshot = await getDoc(docRef);
-
-if (documentSnapshot.exists()) {
-  const data = documentSnapshot.data()
-  const body = data.Vocab +" "+ data.Spelling +" ("+ data.Type +") "+ data.Translate
-  return body
-} else {
-  console.log('Document does not exist.');
-  return ''
-}
-}
+const createNotiBody = async(id)=>{}
 const sendNotification=async(token, message)=>{
   let data = '';
killedBy: createNotiBody should return the notification body when the document exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-vocab test-spelling (test-type) test-translate"
Received: undefined

[Survived] StringLiteral
controllers/User.js:6:46
 const firestore = getFirestore(firebase);
 
 const createNotiBody = async(id)=>{
-  const myCollection = collection(firestore, 'Vocabulary');
+  const myCollection = collection(firestore, "");
   const docRef = doc(myCollection, id);
   const documentSnapshot = await getDoc(docRef);

[Killed] StringLiteral
controllers/User.js:12:48
 
 if (documentSnapshot.exists()) {
   const data = documentSnapshot.data()
-  const body = data.Vocab +" "+ data.Spelling +" ("+ data.Type +") "+ data.Translate
+  const body = data.Vocab +" "+ data.Spelling +""+ data.Type +") "+ data.Translate
   return body
 } else {
killedBy: createNotiBody should return the notification body when the document exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-vocab test-spelling (test-type) test-translate"
Received: "test-vocab test-spellingtest-type) test-translate"

[Killed] StringLiteral
controllers/User.js:12:65
 
 if (documentSnapshot.exists()) {
   const data = documentSnapshot.data()
-  const body = data.Vocab +" "+ data.Spelling +" ("+ data.Type +") "+ data.Translate
+  const body = data.Vocab +" "+ data.Spelling +" ("+ data.Type +""+ data.Translate
   return body
 } else {
killedBy: createNotiBody should return the notification body when the document exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-vocab test-spelling (test-type) test-translate"
Received: "test-vocab test-spelling (test-typetest-translate"

[Killed] BlockStatement
controllers/User.js:14:8
   const data = documentSnapshot.data()
   const body = data.Vocab +" "+ data.Spelling +" ("+ data.Type +") "+ data.Translate
   return body
-} else {
-  console.log('Document does not exist.');
-  return ''
-}
+} else {}
 }
 const sendNotification=async(token, message)=>{
killedBy: createNotiBody should log an error message when the document does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Document does not exist."

Number of calls: 0

[Killed] BlockStatement
controllers/User.js:19:47
   return ''
 }
 }
-const sendNotification=async(token, message)=>{
-  let data = '';
-  await createNotiBody(message).then(item => { data = item});
-  const notificationPayload = {
-    notification: {
-      title: 'Alarm Vocab',
-      body: data,
-    },
-  };
-
-  admin.messaging().sendToDevice(token, notificationPayload)
-    .then((response) => {
-      console.log('Notification sent successfully:', response.results);
-    })
-    .catch((error) => {
-      console.error('Error sending notification:', error);
-    });
-}
+const sendNotification=async(token, message)=>{}
   const setUserInfo = async (req, res) => {
     try {
killedBy: sendNotification function should send notification successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-token", {"notification": {"body": "test-vocab test-spelling (test-type) test-translate", "title": "Alarm Vocab"}}

Number of calls: 0

[Killed] ObjectLiteral
controllers/User.js:23:19
   let data = '';
   await createNotiBody(message).then(item => { data = item});
   const notificationPayload = {
-    notification: {
-      title: 'Alarm Vocab',
-      body: data,
-    },
+    notification: {},
   };
 
killedBy: sendNotification function should send notification successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "test-token",
  Object {
-   "notification": Object {

[Killed] StringLiteral
controllers/User.js:24:14
   await createNotiBody(message).then(item => { data = item});
   const notificationPayload = {
     notification: {
-      title: 'Alarm Vocab',
+      title: "",
       body: data,
     },
killedBy: sendNotification function should send notification successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "test-token",
  Object {
    "notification": Object {

[Killed] StringLiteral
controllers/User.js:31:19
 
   admin.messaging().sendToDevice(token, notificationPayload)
     .then((response) => {
-      console.log('Notification sent successfully:', response.results);
+      console.log("", response.results);
     })
     .catch((error) => {
killedBy: sendNotification function should send notification successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "Notification sent successfully:",
+ "",
  [],

[Timeout] BlockStatement
controllers/User.js:37:43
       console.error('Error sending notification:', error);
     });
 }
-  const setUserInfo = async (req, res) => {
-    try {
-      const myCollection = collection(firestore, 'Users');
-      const docRef1 = doc(myCollection, req.params.userId);
-      await setDoc(docRef1, req.body);
-      console.log("Document successfully set!");
-      res.send({ message: 'User data set successfully' });
-    } catch (error) {
-      console.error("Error setting user document: ", error);
-      res.status(500).json({ success: false, message: 'something went wrong when set user data'});
-    }
-  };
+  const setUserInfo = async (req, res) => {};
   const updateUser = async (req, res) => {
     try {

[Killed] StringLiteral
controllers/User.js:39:50
 }
   const setUserInfo = async (req, res) => {
     try {
-      const myCollection = collection(firestore, 'Users');
+      const myCollection = collection(firestore, "");
       const docRef1 = doc(myCollection, req.params.userId);
       await setDoc(docRef1, req.body);
killedBy: setUserInfo should save data successfully and return response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, "Users"
Received: undefined, ""

Number of calls: 1

[Killed] BlockStatement
controllers/User.js:44:21
       await setDoc(docRef1, req.body);
       console.log("Document successfully set!");
       res.send({ message: 'User data set successfully' });
-    } catch (error) {
-      console.error("Error setting user document: ", error);
-      res.status(500).json({ success: false, message: 'something went wrong when set user data'});
-    }
+    } catch (error) {}
   };
   const updateUser = async (req, res) => {
killedBy: setUserInfo should handle error when adding document
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error setting user document: ", Any<Error>

Number of calls: 0

[Killed] StringLiteral
controllers/User.js:45:21
       console.log("Document successfully set!");
       res.send({ message: 'User data set successfully' });
     } catch (error) {
-      console.error("Error setting user document: ", error);
+      console.error("", error);
       res.status(500).json({ success: false, message: 'something went wrong when set user data'});
     }
killedBy: setUserInfo should handle error when adding document
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error setting user document: ", Any<Error>
Received: "", [Error: Test error]

Number of calls: 1

[Killed] BooleanLiteral
controllers/User.js:46:39
       res.send({ message: 'User data set successfully' });
     } catch (error) {
       console.error("Error setting user document: ", error);
-      res.status(500).json({ success: false, message: 'something went wrong when set user data'});
+      res.status(500).json({ success: true, message: 'something went wrong when set user data'});
     }
   };
killedBy: setUserInfo should handle error when adding document
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "something went wrong when set user data",
-   "success": false,

[Killed] BlockStatement
controllers/User.js:49:42
       res.status(500).json({ success: false, message: 'something went wrong when set user data'});
     }
   };
-  const updateUser = async (req, res) => {
-    try {
-      const myCollection = collection(firestore, 'Users');
-      const docRef1 = doc(myCollection, req.params.userId);
-
-      await updateDoc(docRef1, req.body);
-      console.log("Document successfully updated!");
-      res.send({ message: 'Document successfully updated!' });
-    } catch (error) {
-      console.error("Error updating user document: ", error);
-      res.status(500).json({ success: false, message: 'something went wrong when update user data' });
-    }
-  };
+  const updateUser = async (req, res) => {};
   const getUserData = async (req, res) => {
     try {
killedBy: updateUser should update data successfully and return response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, "Users"

Number of calls: 0

[Killed] BlockStatement
controllers/User.js:50:9
     }
   };
   const updateUser = async (req, res) => {
-    try {
-      const myCollection = collection(firestore, 'Users');
-      const docRef1 = doc(myCollection, req.params.userId);
-
-      await updateDoc(docRef1, req.body);
-      console.log("Document successfully updated!");
-      res.send({ message: 'Document successfully updated!' });
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error updating user document: ", error);
       res.status(500).json({ success: false, message: 'something went wrong when update user data' });
killedBy: updateUser should update data successfully and return response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, "Users"

Number of calls: 0

[Killed] ObjectLiteral
controllers/User.js:56:16
 
       await updateDoc(docRef1, req.body);
       console.log("Document successfully updated!");
-      res.send({ message: 'Document successfully updated!' });
+      res.send({});
     } catch (error) {
       console.error("Error updating user document: ", error);
killedBy: updateUser should update data successfully and return response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Document successfully updated!",
- }

[Killed] BlockStatement
controllers/User.js:57:21
       await updateDoc(docRef1, req.body);
       console.log("Document successfully updated!");
       res.send({ message: 'Document successfully updated!' });
-    } catch (error) {
-      console.error("Error updating user document: ", error);
-      res.status(500).json({ success: false, message: 'something went wrong when update user data' });
-    }
+    } catch (error) {}
   };
   const getUserData = async (req, res) => {
killedBy: updateUser should handle error when adding document
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error updating user document: ", Any<Error>

Number of calls: 0

[Killed] BooleanLiteral
controllers/User.js:59:39
       res.send({ message: 'Document successfully updated!' });
     } catch (error) {
       console.error("Error updating user document: ", error);
-      res.status(500).json({ success: false, message: 'something went wrong when update user data' });
+      res.status(500).json({ success: true, message: 'something went wrong when update user data' });
     }
   };
killedBy: updateUser should handle error when adding document
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "something went wrong when update user data",
-   "success": false,

[Timeout] BlockStatement
controllers/User.js:62:43
       res.status(500).json({ success: false, message: 'something went wrong when update user data' });
     }
   };
-  const getUserData = async (req, res) => {
-    try {
-
-      const myCollection = collection(firestore, 'Users');
-      const docRef1 = doc(myCollection, req.params.userId);
-      const documentSnapshot = await getDoc(docRef1);
-
-      if (documentSnapshot.exists()) {
-        res.send({ success: true, userData: documentSnapshot.data() });
-      } else {
-        res.status(404).send({ success: false, message: 'User not found' });
-      }
-    } catch (error) {
-      console.error("Error get user document: ", error);
-      res.status(500).json({ success: false, message: 'something went wrong when get data from users' });
-    }
-  };
+  const getUserData = async (req, res) => {};
   const getAllUsers = async (req, res) => {
     const myCollection = collection(firestore, 'Users');

[Timeout] BlockStatement
controllers/User.js:74:21
       } else {
         res.status(404).send({ success: false, message: 'User not found' });
       }
-    } catch (error) {
-      console.error("Error get user document: ", error);
-      res.status(500).json({ success: false, message: 'something went wrong when get data from users' });
-    }
+    } catch (error) {}
   };
   const getAllUsers = async (req, res) => {

[Survived] StringLiteral
controllers/User.js:75:21
         res.status(404).send({ success: false, message: 'User not found' });
       }
     } catch (error) {
-      console.error("Error get user document: ", error);
+      console.error("", error);
       res.status(500).json({ success: false, message: 'something went wrong when get data from users' });
     }

[Killed] BooleanLiteral
controllers/User.js:76:39
       }
     } catch (error) {
       console.error("Error get user document: ", error);
-      res.status(500).json({ success: false, message: 'something went wrong when get data from users' });
+      res.status(500).json({ success: true, message: 'something went wrong when get data from users' });
     }
   };
killedBy: getUserData should return an error message on failure
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Timeout] BlockStatement
controllers/User.js:79:43
       res.status(500).json({ success: false, message: 'something went wrong when get data from users' });
     }
   };
-  const getAllUsers = async (req, res) => {
-    const myCollection = collection(firestore, 'Users');
-    try{
-    const querySnapshot = await getDocs(myCollection);
-    const list = querySnapshot.docs.map((doc) => {
-      const data = doc.data();
-      return { ...data };
-    });
-    res.json({success:true, users:list});
-    }
-    catch(error){
-        res.json({success:false, message: 'something went wrong when get data from Users'})
-        console.log(error);
-        return [];
-    }
-  };
+  const getAllUsers = async (req, res) => {};
   module.exports={sendNotification, setUserInfo, updateUser, getAllUsers, getUserData,createNotiBody}

[Timeout] BlockStatement
controllers/User.js:89:17
     });
     res.json({success:true, users:list});
     }
-    catch(error){
-        res.json({success:false, message: 'something went wrong when get data from Users'})
-        console.log(error);
-        return [];
-    }
+    catch(error){}
   };
   module.exports={sendNotification, setUserInfo, updateUser, getAllUsers, getUserData,createNotiBody}

[Killed] BooleanLiteral
controllers/User.js:90:27
     res.json({success:true, users:list});
     }
     catch(error){
-        res.json({success:false, message: 'something went wrong when get data from Users'})
+        res.json({success:true, message: 'something went wrong when get data from Users'})
         console.log(error);
         return [];
killedBy: getAllUsers should return an alert error if an error occurs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ArrayDeclaration
controllers/User.js:92:16
     catch(error){
         res.json({success:false, message: 'something went wrong when get data from Users'})
         console.log(error);
-        return [];
+        return ["Stryker was here"];
     }
   };
