[Killed] ObjectLiteral
controllers/Vocab.js:26:14
         const docId = doc.id;
         return { ...data, Id: docId };
       });
-    res.json({success:true, vocablesson:list});
+    res.json({});
     }
     catch(e){
killedBy: getVocabLesson should return the list of vocab lessons if Firestore query is successful
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ObjectLiteral
controllers/Vocab.js:29:18
     res.json({success:true, vocablesson:list});
     }
     catch(e){
-        res.json({
-            success:false,
-            message:'something went wrong when get data from vocablesson'
-        })
+        res.json({})
         console.log(e)
     }
killedBy: getVocabLesson should return an alert error if an error occurs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ObjectLiteral
controllers/Vocab.js:51:22
         }
         catch(e){
             console.log(e);
-            res.json({
-              success: false,
-              message: "something went wrong when get data from getVocabs",
-            });
+            res.json({});
             return [];
         }
killedBy: getVocabs should return an alert error if an error occurs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
controllers/Vocab.js:68:14
     try {
          const querySnapshot = await getDocs(myCollection);
          const list = querySnapshot.docs.map((doc) => {
-          if(doc.data().TopicId == req.params.TopicId){
+          if(false){
              const data = doc.data();
              const docId = doc.id;
killedBy: getVocabinLesson should return the list of vocabs in a Lesson if Firestore query is successful
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  2

  Array [
-   Object {
-     "Id": "1",

[Killed] ObjectLiteral
controllers/Vocab.js:77:16
           res.json({success:true, vocabs:list});
     } catch (e) {
       console.log(e);
-      res.json({
-        success: false,
-        message: "something went wrong when get data from getVocabinLesson",
-      });
+      res.json({});
       return [];
     }
killedBy: getVocabinLesson should return an alert error if an error occurs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] StringLiteral
controllers/Vocab.js:86:48
 
  }
  const setAlarmVocab = async(req,res)=>{
-    const myCollection = collection(firestore, 'Users');
+    const myCollection = collection(firestore, "");
     const docRef1 = doc(myCollection, req.params.userId);
     try {
killedBy: setAlarmVocab should save data successfully and return response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, "Users"
Received: undefined, ""

Number of calls: 1

[Killed] ObjectLiteral
controllers/Vocab.js:125:18
     try {
         await updateDoc(docRef, req.body);
         console.log('Document successfully updated!');
-        res.send({ message: 'Document successfully updated!' });
+        res.send({});
       } catch (error) {
         console.error('Error updating document: ', error);
killedBy: updateAlarmVocab should update data successfully and return response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Document successfully updated!",
- }
