[Killed] StringLiteral
controllers/PracticePlan.js:9:66
 const targetPerPart1 = [5, 18, null, 22, 20, null, 16, 12, null, 28, null ]; //L(59), R(62)
 const targetPerPart2 = [6, 22, null, 26, 28, null, 22, 14, null, 40, null]; //L(76), R(80)
 const targetPerPart3 = [6, 24, null, 29, 33, null, 25, 15, null, 48, null]; //L(88), R(92)
-const phasesTime1 = ['1', '2 - 4', '5' ,'6 - 8', '9 - 13', '14', '15 - 18', '19 - 21', '22', '23 - 29', '30'];
+const phasesTime1 = ['1', '2 - 4', '5' ,'6 - 8', '9 - 13', '14', "", '19 - 21', '22', '23 - 29', '30'];
 const phasesTime2 = ['1 - 2', '3 - 7', '8', '9 - 14', '15 - 23', '24', '25 - 32', '33 - 40', '41', '42 - 59', '60'];
 const phasesTime3 = ['1 - 3', '4 - 14', '15', '16 - 26', '27 - 43', '44', '45 - 57', '58 - 65', '66', '67 - 89', '90'];
killedBy: buildPracticePlan should build practice plan for 30 days and target level 3
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "Content": "Short Talks",
-   "Days": undefined,

[Killed] ArrayDeclaration
controllers/PracticePlan.js:9:21
 const targetPerPart1 = [5, 18, null, 22, 20, null, 16, 12, null, 28, null ]; //L(59), R(62)
 const targetPerPart2 = [6, 22, null, 26, 28, null, 22, 14, null, 40, null]; //L(76), R(80)
 const targetPerPart3 = [6, 24, null, 29, 33, null, 25, 15, null, 48, null]; //L(88), R(92)
-const phasesTime1 = ['1', '2 - 4', '5' ,'6 - 8', '9 - 13', '14', '15 - 18', '19 - 21', '22', '23 - 29', '30'];
+const phasesTime1 = [];
 const phasesTime2 = ['1 - 2', '3 - 7', '8', '9 - 14', '15 - 23', '24', '25 - 32', '33 - 40', '41', '42 - 59', '60'];
 const phasesTime3 = ['1 - 3', '4 - 14', '15', '16 - 26', '27 - 43', '44', '45 - 57', '58 - 65', '66', '67 - 89', '90'];
killedBy: buildPracticePlan should build practice plan for 30 days and target level 3
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 11
Received length: 0
Received array:  []

[Killed] StringLiteral
controllers/PracticePlan.js:10:55
 const targetPerPart2 = [6, 22, null, 26, 28, null, 22, 14, null, 40, null]; //L(76), R(80)
 const targetPerPart3 = [6, 24, null, 29, 33, null, 25, 15, null, 48, null]; //L(88), R(92)
 const phasesTime1 = ['1', '2 - 4', '5' ,'6 - 8', '9 - 13', '14', '15 - 18', '19 - 21', '22', '23 - 29', '30'];
-const phasesTime2 = ['1 - 2', '3 - 7', '8', '9 - 14', '15 - 23', '24', '25 - 32', '33 - 40', '41', '42 - 59', '60'];
+const phasesTime2 = ['1 - 2', '3 - 7', '8', '9 - 14', "", '24', '25 - 32', '33 - 40', '41', '42 - 59', '60'];
 const phasesTime3 = ['1 - 3', '4 - 14', '15', '16 - 26', '27 - 43', '44', '45 - 57', '58 - 65', '66', '67 - 89', '90'];
 const phasesTime4 = ['1 - 4', '5 - 19', '20', '21 - 34', '35 - 55', '56', '57 - 73', '74 - 87', '88', '89 - 119', '120'];
killedBy: buildPracticePlan should build practice plan for 60 days and target level 4
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "Content": "Short Conversations",
-   "Days": undefined,

[Killed] StringLiteral
controllers/PracticePlan.js:10:22
 const targetPerPart2 = [6, 22, null, 26, 28, null, 22, 14, null, 40, null]; //L(76), R(80)
 const targetPerPart3 = [6, 24, null, 29, 33, null, 25, 15, null, 48, null]; //L(88), R(92)
 const phasesTime1 = ['1', '2 - 4', '5' ,'6 - 8', '9 - 13', '14', '15 - 18', '19 - 21', '22', '23 - 29', '30'];
-const phasesTime2 = ['1 - 2', '3 - 7', '8', '9 - 14', '15 - 23', '24', '25 - 32', '33 - 40', '41', '42 - 59', '60'];
+const phasesTime2 = ["", '3 - 7', '8', '9 - 14', '15 - 23', '24', '25 - 32', '33 - 40', '41', '42 - 59', '60'];
 const phasesTime3 = ['1 - 3', '4 - 14', '15', '16 - 26', '27 - 43', '44', '45 - 57', '58 - 65', '66', '67 - 89', '90'];
 const phasesTime4 = ['1 - 4', '5 - 19', '20', '21 - 34', '35 - 55', '56', '57 - 73', '74 - 87', '88', '89 - 119', '120'];
killedBy: buildPracticePlan should build practice plan for 60 days and target level 4
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
controllers/PracticePlan.js:11:41
 const targetPerPart3 = [6, 24, null, 29, 33, null, 25, 15, null, 48, null]; //L(88), R(92)
 const phasesTime1 = ['1', '2 - 4', '5' ,'6 - 8', '9 - 13', '14', '15 - 18', '19 - 21', '22', '23 - 29', '30'];
 const phasesTime2 = ['1 - 2', '3 - 7', '8', '9 - 14', '15 - 23', '24', '25 - 32', '33 - 40', '41', '42 - 59', '60'];
-const phasesTime3 = ['1 - 3', '4 - 14', '15', '16 - 26', '27 - 43', '44', '45 - 57', '58 - 65', '66', '67 - 89', '90'];
+const phasesTime3 = ['1 - 3', '4 - 14', "", '16 - 26', '27 - 43', '44', '45 - 57', '58 - 65', '66', '67 - 89', '90'];
 const phasesTime4 = ['1 - 4', '5 - 19', '20', '21 - 34', '35 - 55', '56', '57 - 73', '74 - 87', '88', '89 - 119', '120'];
killedBy: buildPracticePlan should build practice plan for 90 days and target level 5
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "Content": "Test 1",
-   "Phases": "15",

[Killed] StringLiteral
controllers/PracticePlan.js:11:69
 const targetPerPart3 = [6, 24, null, 29, 33, null, 25, 15, null, 48, null]; //L(88), R(92)
 const phasesTime1 = ['1', '2 - 4', '5' ,'6 - 8', '9 - 13', '14', '15 - 18', '19 - 21', '22', '23 - 29', '30'];
 const phasesTime2 = ['1 - 2', '3 - 7', '8', '9 - 14', '15 - 23', '24', '25 - 32', '33 - 40', '41', '42 - 59', '60'];
-const phasesTime3 = ['1 - 3', '4 - 14', '15', '16 - 26', '27 - 43', '44', '45 - 57', '58 - 65', '66', '67 - 89', '90'];
+const phasesTime3 = ['1 - 3', '4 - 14', '15', '16 - 26', '27 - 43', "", '45 - 57', '58 - 65', '66', '67 - 89', '90'];
 const phasesTime4 = ['1 - 4', '5 - 19', '20', '21 - 34', '35 - 55', '56', '57 - 73', '74 - 87', '88', '89 - 119', '120'];
killedBy: buildPracticePlan should build practice plan for 90 days and target level 5
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "Content": "Test 2",
-   "Phases": "44",

[Killed] StringLiteral
controllers/PracticePlan.js:12:97
 const phasesTime1 = ['1', '2 - 4', '5' ,'6 - 8', '9 - 13', '14', '15 - 18', '19 - 21', '22', '23 - 29', '30'];
 const phasesTime2 = ['1 - 2', '3 - 7', '8', '9 - 14', '15 - 23', '24', '25 - 32', '33 - 40', '41', '42 - 59', '60'];
 const phasesTime3 = ['1 - 3', '4 - 14', '15', '16 - 26', '27 - 43', '44', '45 - 57', '58 - 65', '66', '67 - 89', '90'];
-const phasesTime4 = ['1 - 4', '5 - 19', '20', '21 - 34', '35 - 55', '56', '57 - 73', '74 - 87', '88', '89 - 119', '120'];
+const phasesTime4 = ['1 - 4', '5 - 19', '20', '21 - 34', '35 - 55', '56', '57 - 73', '74 - 87', "", '89 - 119', '120'];
 
killedBy: buildPracticePlan should build practice plan for 120 days and target level 5
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "Content": "Test 3",
-   "Phases": "88",

[Killed] StringLiteral
controllers/PracticePlan.js:12:103
 const phasesTime1 = ['1', '2 - 4', '5' ,'6 - 8', '9 - 13', '14', '15 - 18', '19 - 21', '22', '23 - 29', '30'];
 const phasesTime2 = ['1 - 2', '3 - 7', '8', '9 - 14', '15 - 23', '24', '25 - 32', '33 - 40', '41', '42 - 59', '60'];
 const phasesTime3 = ['1 - 3', '4 - 14', '15', '16 - 26', '27 - 43', '44', '45 - 57', '58 - 65', '66', '67 - 89', '90'];
-const phasesTime4 = ['1 - 4', '5 - 19', '20', '21 - 34', '35 - 55', '56', '57 - 73', '74 - 87', '88', '89 - 119', '120'];
+const phasesTime4 = ['1 - 4', '5 - 19', '20', '21 - 34', '35 - 55', '56', '57 - 73', '74 - 87', '88', "", '120'];
 
killedBy: buildPracticePlan should build practice plan for 120 days and target level 5
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "Content": "Reading Comprehension",
-   "Days": undefined,

[Killed] ConditionalExpression
controllers/PracticePlan.js:21:9
     let TargetPerPart = [];
     let QuestionsPerDay = 0;
     switch (practiceDays) {
-        case 30:
-            Phases = phasesTime1;
-            QuestionsPerDay = 90 + (targetLevel - currentLevel - 1) * 30;
-            break;        
+        case 30:        
         case 60:
             Phases = phasesTime2;
killedBy: buildPracticePlan should build practice plan for 30 days and target level 3
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -10,8 +10,8 @@
        "CompletedQuestion": 0,
        "Day": 2,

[Killed] ArithmeticOperator
controllers/PracticePlan.js:23:37
     switch (practiceDays) {
         case 30:
             Phases = phasesTime1;
-            QuestionsPerDay = 90 + (targetLevel - currentLevel - 1) * 30;
+            QuestionsPerDay = 90 + (targetLevel + currentLevel - 1) * 30;
             break;        
         case 60:
killedBy: buildPracticePlan should build practice plan for 30 days and target level 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 90
Received: 210

[Killed] ArithmeticOperator
controllers/PracticePlan.js:23:37
     switch (practiceDays) {
         case 30:
             Phases = phasesTime1;
-            QuestionsPerDay = 90 + (targetLevel - currentLevel - 1) * 30;
+            QuestionsPerDay = 90 + (targetLevel - currentLevel + 1) * 30;
             break;        
         case 60:
killedBy: buildPracticePlan should build practice plan for 30 days and target level 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 90
Received: 150

[Killed] ConditionalExpression
controllers/PracticePlan.js:25:9
             Phases = phasesTime1;
             QuestionsPerDay = 90 + (targetLevel - currentLevel - 1) * 30;
             break;        
-        case 60:
-            Phases = phasesTime2;
-            QuestionsPerDay = 45 + (targetLevel - currentLevel - 1) * 15;
-            break;
+        case 60:
         case 90:
             Phases = phasesTime3;
killedBy: buildPracticePlan should build practice plan for 60 days and target level 4
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -15,8 +15,8 @@
        "CompletedQuestion": 0,
        "Day": 3,

[Killed] ArithmeticOperator
controllers/PracticePlan.js:27:36
             break;        
         case 60:
             Phases = phasesTime2;
-            QuestionsPerDay = 45 + (targetLevel - currentLevel - 1) * 15;
+            QuestionsPerDay = 45 + (targetLevel - currentLevel - 1) / 15;
             break;
         case 90:
killedBy: buildPracticePlan should build practice plan for 60 days and target level 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 60
Received: 45.06666666666667

[Killed] ArithmeticOperator
controllers/PracticePlan.js:27:37
             break;        
         case 60:
             Phases = phasesTime2;
-            QuestionsPerDay = 45 + (targetLevel - currentLevel - 1) * 15;
+            QuestionsPerDay = 45 + (targetLevel + currentLevel - 1) * 15;
             break;
         case 90:
killedBy: buildPracticePlan should build practice plan for 60 days and target level 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 60
Received: 120

[Killed] ConditionalExpression
controllers/PracticePlan.js:29:9
             Phases = phasesTime2;
             QuestionsPerDay = 45 + (targetLevel - currentLevel - 1) * 15;
             break;
-        case 90:
-            Phases = phasesTime3;
-            QuestionsPerDay = 30 + (targetLevel - currentLevel - 1) * 10;
-            break; 
+        case 90: 
         case 120:
             Phases = phasesTime4;
killedBy: buildPracticePlan should build practice plan for 90 days and target level 5
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -20,8 +20,8 @@
        "CompletedQuestion": 0,
        "Day": 4,

[Killed] ArithmeticOperator
controllers/PracticePlan.js:31:36
             break;
         case 90:
             Phases = phasesTime3;
-            QuestionsPerDay = 30 + (targetLevel - currentLevel - 1) * 10;
+            QuestionsPerDay = 30 + (targetLevel - currentLevel - 1) / 10;
             break; 
         case 120:
killedBy: buildPracticePlan should build practice plan for 90 days and target level 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 30.1

[Killed] ArithmeticOperator
controllers/PracticePlan.js:31:31
             break;
         case 90:
             Phases = phasesTime3;
-            QuestionsPerDay = 30 + (targetLevel - currentLevel - 1) * 10;
+            QuestionsPerDay = 30 - (targetLevel - currentLevel - 1) * 10;
             break; 
         case 120:
killedBy: buildPracticePlan should build practice plan for 90 days and target level 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 20

[Killed] ConditionalExpression
controllers/PracticePlan.js:33:9
             Phases = phasesTime3;
             QuestionsPerDay = 30 + (targetLevel - currentLevel - 1) * 10;
             break; 
-        case 120:
-            Phases = phasesTime4;
-            QuestionsPerDay = 25 + (targetLevel - currentLevel - 1) * 7;
-            break;         
+        case 120:         
         default: 
             return null;           
killedBy: buildPracticePlan should build practice plan for 120 days and target level 5
statusReason: TypeError: Cannot read properties of null (reading 'PracticePhases')

[Killed] ArithmeticOperator
controllers/PracticePlan.js:35:36
             break; 
         case 120:
             Phases = phasesTime4;
-            QuestionsPerDay = 25 + (targetLevel - currentLevel - 1) * 7;
+            QuestionsPerDay = 25 + (targetLevel - currentLevel - 1) / 7;
             break;         
         default: 
killedBy: buildPracticePlan should build practice plan for 120 days and target level 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 39
Received: 25.285714285714285

[Killed] ArithmeticOperator
controllers/PracticePlan.js:35:31
             break; 
         case 120:
             Phases = phasesTime4;
-            QuestionsPerDay = 25 + (targetLevel - currentLevel - 1) * 7;
+            QuestionsPerDay = 25 - (targetLevel - currentLevel - 1) * 7;
             break;         
         default: 
killedBy: buildPracticePlan should build practice plan for 120 days and target level 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 39
Received: 11

[Killed] ConditionalExpression
controllers/PracticePlan.js:37:9
             Phases = phasesTime4;
             QuestionsPerDay = 25 + (targetLevel - currentLevel - 1) * 7;
             break;         
-        default: 
-            return null;           
+        default:           
     }
     switch(targetLevel){
killedBy: buildPracticePlan should handle unknown practiceDays
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: null
Received: {"CurrentLevel": 2, "CurrentPhase": {"CurrentDay": 1, "PhaseIndex": 0}, "PracticeDays": -1, "PracticePhases": [], "QuestionsPerDay": 0, "TargetLevel": 5, "userId": "mockUserId"}

[Killed] ConditionalExpression
controllers/PracticePlan.js:41:9
             return null;           
     }
     switch(targetLevel){
-        case 3:
-            TargetPerPart = targetPerPart1;
-            break;        
+        case 3:        
         case 4:
             TargetPerPart = targetPerPart2;
killedBy: buildPracticePlan should build practice plan for 30 days and target level 3
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -6,7 +6,7 @@
        "Day": 1,
        "NumberofQuestions": 90,

[Killed] ConditionalExpression
controllers/PracticePlan.js:44:9
         case 3:
             TargetPerPart = targetPerPart1;
             break;        
-        case 4:
-            TargetPerPart = targetPerPart2;
-            break;
+        case 4:
         case 5:
             TargetPerPart = targetPerPart3;
killedBy: buildPracticePlan should build practice plan for 60 days and target level 4
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -26,7 +26,7 @@
        "Day": 7,
        "NumberofQuestions": 60,

[Killed] ConditionalExpression
controllers/PracticePlan.js:47:9
         case 4:
             TargetPerPart = targetPerPart2;
             break;
-        case 5:
-            TargetPerPart = targetPerPart3;
-            break;         
+        case 5:         
         default:            
             return null;
killedBy: buildPracticePlan should build practice plan for 90 days and target level 5
statusReason: TypeError: Cannot read properties of null (reading 'PracticePhases')

[Killed] EqualityOperator
controllers/PracticePlan.js:53:20
         default:            
             return null;
     }
-    for(let i = 0; i < Phases.length; i++){
+    for(let i = 0; i <= Phases.length; i++){
         const [start, end] = Phases[i].split('-').map(num => parseInt(num.trim()));
         const Days = [];
killedBy: buildPracticePlan should build practice plan for 30 days and target level 3
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] UpdateOperator
controllers/PracticePlan.js:53:39
         default:            
             return null;
     }
-    for(let i = 0; i < Phases.length; i++){
+    for(let i = 0; i < Phases.length; i--){
         const [start, end] = Phases[i].split('-').map(num => parseInt(num.trim()));
         const Days = [];
killedBy: buildPracticePlan should build practice plan for 30 days and target level 3
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] ArrowFunction
controllers/PracticePlan.js:54:55
             return null;
     }
     for(let i = 0; i < Phases.length; i++){
-        const [start, end] = Phases[i].split('-').map(num => parseInt(num.trim()));
+        const [start, end] = Phases[i].split('-').map(() => undefined);
         const Days = [];
         // If test day
killedBy: buildPracticePlan should build practice plan for 30 days and target level 3
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Timeout] MethodExpression
controllers/PracticePlan.js:54:71
             return null;
     }
     for(let i = 0; i < Phases.length; i++){
-        const [start, end] = Phases[i].split('-').map(num => parseInt(num.trim()));
+        const [start, end] = Phases[i].split('-').map(num => parseInt(num));
         const Days = [];
         // If test day

[Killed] ConditionalExpression
controllers/PracticePlan.js:57:13
         const [start, end] = Phases[i].split('-').map(num => parseInt(num.trim()));
         const Days = [];
         // If test day
-        if (end === undefined){  
+        if (false){  
             if(start === 1){
                 Days.push({ 
killedBy: buildPracticePlan should build practice plan for 30 days and target level 3
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"CompletedQuestion": 0, "Day": 1, "NumberofQuestions": 90}
Received: undefined

[Killed] BlockStatement
controllers/PracticePlan.js:57:31
         const [start, end] = Phases[i].split('-').map(num => parseInt(num.trim()));
         const Days = [];
         // If test day
-        if (end === undefined){  
-            if(start === 1){
-                Days.push({ 
-                    Day: 1, 
-                    NumberofQuestions: QuestionsPerDay,
-                    CompletedQuestion: 0,
-                });
-                PracticePhases[0] = {
-                    Phases: Phases[0],
-                    Target: TargetPerPart[0],
-                    Content: practiceContent[0],
-                    Days: Days,
-                }
-            }
-            else{
-                PracticePhases[i] = {
-                    Phases: Phases[i],
-                    Target: TargetPerPart[i],
-                    Content: practiceContent[i],
-                    Test: 'testId'
-                } 
-            }
-        } 
+        if (end === undefined){} 
         // If practice day                    
         else{
killedBy: buildPracticePlan should build practice plan for 30 days and target level 3
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 11
Received length: 10

[Killed] EqualityOperator
controllers/PracticePlan.js:58:16
         const Days = [];
         // If test day
         if (end === undefined){  
-            if(start === 1){
+            if(start !== 1){
                 Days.push({ 
                     Day: 1, 
killedBy: buildPracticePlan should build practice plan for 30 days and target level 3
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 11
Received length: 10

[Killed] ConditionalExpression
controllers/PracticePlan.js:58:16
         const Days = [];
         // If test day
         if (end === undefined){  
-            if(start === 1){
+            if(false){
                 Days.push({ 
                     Day: 1, 
killedBy: buildPracticePlan should build practice plan for 30 days and target level 3
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
controllers/PracticePlan.js:71:17
                     Days: Days,
                 }
             }
-            else{
-                PracticePhases[i] = {
-                    Phases: Phases[i],
-                    Target: TargetPerPart[i],
-                    Content: practiceContent[i],
-                    Test: 'testId'
-                } 
-            }
+            else{}
         } 
         // If practice day                    
killedBy: buildPracticePlan should build practice plan for 30 days and target level 3
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 11
Received length: 10

[Survived] BlockStatement
controllers/PracticePlan.js:81:13
             }
         } 
         // If practice day                    
-        else{
-            for(let i = start; i <= end; i++) {                  
-                Days.push({ 
-                    Day: i, 
-                    NumberofQuestions: QuestionsPerDay,
-                    CompletedQuestion: 0,
-                });
-                //console.log(Days);
-            } 
-            PracticePhases[i] = {
-                Phases: Phases[i],
-                Target: TargetPerPart[i],
-                Content: practiceContent[i],
-                Days: Days,
-            }
-        }                   
+        else{}                   
     }
     return {

[Killed] EqualityOperator
controllers/PracticePlan.js:82:32
         } 
         // If practice day                    
         else{
-            for(let i = start; i <= end; i++) {                  
+            for(let i = start; i > end; i++) {                  
                 Days.push({ 
                     Day: i, 
killedBy: buildPracticePlan should build practice plan for 60 days and target level 4
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"CompletedQuestion": 0, "Day": 1, "NumberofQuestions": 60}
Received: undefined

[Killed] BlockStatement
controllers/PracticePlan.js:82:47
         } 
         // If practice day                    
         else{
-            for(let i = start; i <= end; i++) {                  
-                Days.push({ 
-                    Day: i, 
-                    NumberofQuestions: QuestionsPerDay,
-                    CompletedQuestion: 0,
-                });
-                //console.log(Days);
-            } 
+            for(let i = start; i <= end; i++) {} 
             PracticePhases[i] = {
                 Phases: Phases[i],
killedBy: buildPracticePlan should build practice plan for 60 days and target level 4
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"CompletedQuestion": 0, "Day": 1, "NumberofQuestions": 60}
Received: undefined

[Killed] BlockStatement
controllers/PracticePlan.js:112:48
     } 
 };
 
-const uploadPracticePlan = async (req, res) => {
-    try {
-        const myCollection = collection(firestore, 'PracticePlan');
-        const PracticePlan = await buildPracticePlan(req.body.currentLevel, req.body.targetLevel, req.body.practiceDays, req.params.userId);
-        //console.log(PracticePlan);
-        const specificDocRef = doc(myCollection, req.params.userId);
-        await setDoc(specificDocRef, PracticePlan);
-        console.log("Document successfully post!");
-        res.send({ success: true, message: 'Practice Plan post successfully' });
-    } catch (error) {
-        console.error("Error post plan document: ", error);
-        res.status(500).json({ success: false, message: error.message });
-    }
-}
+const uploadPracticePlan = async (req, res) => {}
 
 const getPracticePlan= async (req, res) => {
killedBy: uploadPracticePlan should upload practice plan successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, "PracticePlan"

Number of calls: 0

[Killed] BlockStatement
controllers/PracticePlan.js:113:9
 };
 
 const uploadPracticePlan = async (req, res) => {
-    try {
-        const myCollection = collection(firestore, 'PracticePlan');
-        const PracticePlan = await buildPracticePlan(req.body.currentLevel, req.body.targetLevel, req.body.practiceDays, req.params.userId);
-        //console.log(PracticePlan);
-        const specificDocRef = doc(myCollection, req.params.userId);
-        await setDoc(specificDocRef, PracticePlan);
-        console.log("Document successfully post!");
-        res.send({ success: true, message: 'Practice Plan post successfully' });
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error post plan document: ", error);
         res.status(500).json({ success: false, message: error.message });
killedBy: uploadPracticePlan should upload practice plan successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, "PracticePlan"

Number of calls: 0

[Killed] StringLiteral
controllers/PracticePlan.js:114:52
 
 const uploadPracticePlan = async (req, res) => {
     try {
-        const myCollection = collection(firestore, 'PracticePlan');
+        const myCollection = collection(firestore, "");
         const PracticePlan = await buildPracticePlan(req.body.currentLevel, req.body.targetLevel, req.body.practiceDays, req.params.userId);
         //console.log(PracticePlan);
killedBy: uploadPracticePlan should upload practice plan successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, "PracticePlan"
Received: undefined, ""

Number of calls: 1

[Killed] BooleanLiteral
controllers/PracticePlan.js:120:29
         const specificDocRef = doc(myCollection, req.params.userId);
         await setDoc(specificDocRef, PracticePlan);
         console.log("Document successfully post!");
-        res.send({ success: true, message: 'Practice Plan post successfully' });
+        res.send({ success: false, message: 'Practice Plan post successfully' });
     } catch (error) {
         console.error("Error post plan document: ", error);
killedBy: uploadPracticePlan should upload practice plan successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Practice Plan post successfully",
-   "success": true,

[Killed] BlockStatement
controllers/PracticePlan.js:121:21
         await setDoc(specificDocRef, PracticePlan);
         console.log("Document successfully post!");
         res.send({ success: true, message: 'Practice Plan post successfully' });
-    } catch (error) {
-        console.error("Error post plan document: ", error);
-        res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: uploadPracticePlan should handle error when uploading practice plan
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error post plan document: ", Any<Error>

Number of calls: 0

[Killed] BooleanLiteral
controllers/PracticePlan.js:123:41
         res.send({ success: true, message: 'Practice Plan post successfully' });
     } catch (error) {
         console.error("Error post plan document: ", error);
-        res.status(500).json({ success: false, message: error.message });
+        res.status(500).json({ success: true, message: error.message });
     }
 }
killedBy: uploadPracticePlan should handle error when uploading practice plan
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Test error",
-   "success": false,

[Killed] ObjectLiteral
controllers/PracticePlan.js:123:30
         res.send({ success: true, message: 'Practice Plan post successfully' });
     } catch (error) {
         console.error("Error post plan document: ", error);
-        res.status(500).json({ success: false, message: error.message });
+        res.status(500).json({});
     }
 }
killedBy: uploadPracticePlan should handle error when uploading practice plan
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Test error",
-   "success": false,
