[Timeout] BlockStatement
controllers/PracticePlan.js:127:44
     }
 }
 
-const getPracticePlan= async (req, res) => {
-    try {
-        const myCollection = collection(firestore, 'PracticePlan');
-        const docRef1 = doc(myCollection, req.params.userId);
-        const documentSnapshot = await getDoc(docRef1);
-  
-        if (documentSnapshot.exists()) {
-          res.send({ success: true, PracticePlan: documentSnapshot.data() });
-        } else {
-          res.status(404).send({ success: false, message: 'Practice plan not found' });
-        }
-      } catch (error) {
-        console.error("Error get plan document: ", error);
-        res.status(500).json({ success: false, message: 'something went wrong when get data from practice plan' });
-      }
-}
+const getPracticePlan= async (req, res) => {}
 
 const updatePracticePlan = async (req, res) => {

[Timeout] BlockStatement
controllers/PracticePlan.js:128:9
 }
 
 const getPracticePlan= async (req, res) => {
-    try {
-        const myCollection = collection(firestore, 'PracticePlan');
-        const docRef1 = doc(myCollection, req.params.userId);
-        const documentSnapshot = await getDoc(docRef1);
-  
-        if (documentSnapshot.exists()) {
-          res.send({ success: true, PracticePlan: documentSnapshot.data() });
-        } else {
-          res.status(404).send({ success: false, message: 'Practice plan not found' });
-        }
-      } catch (error) {
+    try {} catch (error) {
         console.error("Error get plan document: ", error);
         res.status(500).json({ success: false, message: 'something went wrong when get data from practice plan' });

[Killed] BooleanLiteral
controllers/PracticePlan.js:134:31
         const documentSnapshot = await getDoc(docRef1);
   
         if (documentSnapshot.exists()) {
-          res.send({ success: true, PracticePlan: documentSnapshot.data() });
+          res.send({ success: false, PracticePlan: documentSnapshot.data() });
         } else {
           res.status(404).send({ success: false, message: 'Practice plan not found' });
killedBy: getPracticePlan should return practice plan when document exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ObjectLiteral
controllers/PracticePlan.js:134:20
         const documentSnapshot = await getDoc(docRef1);
   
         if (documentSnapshot.exists()) {
-          res.send({ success: true, PracticePlan: documentSnapshot.data() });
+          res.send({});
         } else {
           res.status(404).send({ success: false, message: 'Practice plan not found' });
killedBy: getPracticePlan should return practice plan when document exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: undefined

[Timeout] BlockStatement
controllers/PracticePlan.js:135:16
   
         if (documentSnapshot.exists()) {
           res.send({ success: true, PracticePlan: documentSnapshot.data() });
-        } else {
-          res.status(404).send({ success: false, message: 'Practice plan not found' });
-        }
+        } else {}
       } catch (error) {
         console.error("Error get plan document: ", error);

[Killed] BooleanLiteral
controllers/PracticePlan.js:136:43
         if (documentSnapshot.exists()) {
           res.send({ success: true, PracticePlan: documentSnapshot.data() });
         } else {
-          res.status(404).send({ success: false, message: 'Practice plan not found' });
+          res.status(404).send({ success: true, message: 'Practice plan not found' });
         }
       } catch (error) {
killedBy: getPracticePlan should return alert when document does not exist
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ObjectLiteral
controllers/PracticePlan.js:136:32
         if (documentSnapshot.exists()) {
           res.send({ success: true, PracticePlan: documentSnapshot.data() });
         } else {
-          res.status(404).send({ success: false, message: 'Practice plan not found' });
+          res.status(404).send({});
         }
       } catch (error) {
killedBy: getPracticePlan should return alert when document does not exist
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: undefined

[Timeout] BlockStatement
controllers/PracticePlan.js:138:23
         } else {
           res.status(404).send({ success: false, message: 'Practice plan not found' });
         }
-      } catch (error) {
-        console.error("Error get plan document: ", error);
-        res.status(500).json({ success: false, message: 'something went wrong when get data from practice plan' });
-      }
+      } catch (error) {}
 }
 

[Survived] StringLiteral
controllers/PracticePlan.js:139:23
           res.status(404).send({ success: false, message: 'Practice plan not found' });
         }
       } catch (error) {
-        console.error("Error get plan document: ", error);
+        console.error("", error);
         res.status(500).json({ success: false, message: 'something went wrong when get data from practice plan' });
       }

[Killed] BooleanLiteral
controllers/PracticePlan.js:140:41
         }
       } catch (error) {
         console.error("Error get plan document: ", error);
-        res.status(500).json({ success: false, message: 'something went wrong when get data from practice plan' });
+        res.status(500).json({ success: true, message: 'something went wrong when get data from practice plan' });
       }
 }
killedBy: getPracticePlan should return an error message on failure
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ObjectLiteral
controllers/PracticePlan.js:140:30
         }
       } catch (error) {
         console.error("Error get plan document: ", error);
-        res.status(500).json({ success: false, message: 'something went wrong when get data from practice plan' });
+        res.status(500).json({});
       }
 }
killedBy: getPracticePlan should return an error message on failure
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] BlockStatement
controllers/PracticePlan.js:144:48
       }
 }
 
-const updatePracticePlan = async (req, res) => {
-    try {
-        const myCollection = collection(firestore, 'PracticePlan');
-        const docRef1 = doc(myCollection, req.params.userId);
-  
-        await updateDoc(docRef1, req.body);
-        console.log("Document successfully updated!");
-        res.send({ message: 'Practice plan updated successfully' });
-    } catch (error) {
-        console.error("Error updating PracticePlan document: ", error);
-        res.status(500).json({ success: false, message: 'something went wrong when update practice plan' });
-    }
-}
+const updatePracticePlan = async (req, res) => {}
 
 module.exports = { buildPracticePlan, uploadPracticePlan, getPracticePlan, updatePracticePlan,};
killedBy: updatePracticePlan should update data successfully and return response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, "PracticePlan"

Number of calls: 0

[Killed] BlockStatement
controllers/PracticePlan.js:145:9
 }
 
 const updatePracticePlan = async (req, res) => {
-    try {
-        const myCollection = collection(firestore, 'PracticePlan');
-        const docRef1 = doc(myCollection, req.params.userId);
-  
-        await updateDoc(docRef1, req.body);
-        console.log("Document successfully updated!");
-        res.send({ message: 'Practice plan updated successfully' });
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error updating PracticePlan document: ", error);
         res.status(500).json({ success: false, message: 'something went wrong when update practice plan' });
killedBy: updatePracticePlan should update data successfully and return response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, "PracticePlan"

Number of calls: 0

[Killed] StringLiteral
controllers/PracticePlan.js:151:29
   
         await updateDoc(docRef1, req.body);
         console.log("Document successfully updated!");
-        res.send({ message: 'Practice plan updated successfully' });
+        res.send({ message: "" });
     } catch (error) {
         console.error("Error updating PracticePlan document: ", error);
killedBy: updatePracticePlan should update data successfully and return response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Practice plan updated successfully",
+   "message": "",

[Killed] BlockStatement
controllers/PracticePlan.js:152:21
         await updateDoc(docRef1, req.body);
         console.log("Document successfully updated!");
         res.send({ message: 'Practice plan updated successfully' });
-    } catch (error) {
-        console.error("Error updating PracticePlan document: ", error);
-        res.status(500).json({ success: false, message: 'something went wrong when update practice plan' });
-    }
+    } catch (error) {}
 }
 
killedBy: updatePracticePlan should handle error when adding document
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error updating PracticePlan document: ", Any<Error>

Number of calls: 0

[Killed] BooleanLiteral
controllers/PracticePlan.js:154:41
         res.send({ message: 'Practice plan updated successfully' });
     } catch (error) {
         console.error("Error updating PracticePlan document: ", error);
-        res.status(500).json({ success: false, message: 'something went wrong when update practice plan' });
+        res.status(500).json({ success: true, message: 'something went wrong when update practice plan' });
     }
 }
killedBy: updatePracticePlan should handle error when adding document
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "something went wrong when update practice plan",
-   "success": false,

[Killed] ObjectLiteral
controllers/PracticePlan.js:154:30
         res.send({ message: 'Practice plan updated successfully' });
     } catch (error) {
         console.error("Error updating PracticePlan document: ", error);
-        res.status(500).json({ success: false, message: 'something went wrong when update practice plan' });
+        res.status(500).json({});
     }
 }
killedBy: updatePracticePlan should handle error when adding document
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "something went wrong when update practice plan",
-   "success": false,
