[Killed] BlockStatement
controllers/SWskills.js:38:51
         res.status(500).send({ success: false, message: 'Upload audio failed' });
     }
 };
-const uploadPracticeHistory = async (req, res) => {
-    try {
-        const myCollection = collection(firestore, 'PracticeHistory');
-        await addDoc(myCollection, req.body);
-        console.log("Document successfully post!");
-        res.send({ message: 'Practice History post successfully' });
-      } catch (error) {
-        console.error("Error post history document: ", error);
-        res.status(500).json({ success: false, message: 'something went wrong when upload practice history' });
-      }
-}
+const uploadPracticeHistory = async (req, res) => {}
 
 module.exports = { uploadAudio, uploadPracticeHistory };
killedBy: uploadPracticeHistory should save data successfully and return response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, "PracticeHistory"

Number of calls: 0

[Killed] BlockStatement
controllers/SWskills.js:44:23
         await addDoc(myCollection, req.body);
         console.log("Document successfully post!");
         res.send({ message: 'Practice History post successfully' });
-      } catch (error) {
-        console.error("Error post history document: ", error);
-        res.status(500).json({ success: false, message: 'something went wrong when upload practice history' });
-      }
+      } catch (error) {}
 }
 
killedBy: uploadPracticeHistory should handle error when adding document
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error post history document: ", Any<Error>

Number of calls: 0

[Killed] BooleanLiteral
controllers/SWskills.js:46:41
         res.send({ message: 'Practice History post successfully' });
       } catch (error) {
         console.error("Error post history document: ", error);
-        res.status(500).json({ success: false, message: 'something went wrong when upload practice history' });
+        res.status(500).json({ success: true, message: 'something went wrong when upload practice history' });
       }
 }
killedBy: uploadPracticeHistory should handle error when adding document
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "something went wrong when upload practice history",
-   "success": false,

[Killed] StringLiteral
controllers/SWskills.js:46:57
         res.send({ message: 'Practice History post successfully' });
       } catch (error) {
         console.error("Error post history document: ", error);
-        res.status(500).json({ success: false, message: 'something went wrong when upload practice history' });
+        res.status(500).json({ success: false, message: "" });
       }
 }
killedBy: uploadPracticeHistory should handle error when adding document
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "something went wrong when upload practice history",
+   "message": "",
